app/views/patients/index.html.erb

  <% @patients.each do |patient| %>
    <span>Name: <%= patient.name %> Number of Appointments: <%= patient.appointments.count %></span>
---
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 1]]