app/views/patients/show.html.erb

<br>
<% @patient.appointments.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 2]]